docs/recipes/vegetable-paella.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vegetable Paella</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../static/common.css" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Vegetable Paella</h1>
<p>
<a href="https://realfood.tesco.com/recipes/vegetable-paella.html">Original link</a>
</p>

<div id="outline-container-org72ed2ca" class="outline-2">
<h2 id="org72ed2ca">Ingredients</h2>
<div class="outline-text-2" id="text-org72ed2ca">
<ul class="org-ul">
<li>1 tbsp oil</li>
<li>1 onion, chopped</li>
<li>1 garlic clove, finely chopped</li>
<li>300g paella rice or short grain rice</li>
<li>2tsp smoked paprika</li>
<li>900ml vegetable stock</li>
<li>1 x 400g tin chopped tomatoes</li>
<li>150g runner beans, sliced on an angle</li>
<li>1 red pepper, roughly chopped</li>
<li>1 x 210g tin chickpeas, drained</li>
<li>handful parsley, roughly chopped</li>
<li>1 tsp dried chilli flakes</li>
<li>1 lemon, juiced</li>
<li>a pinch of salt</li>
<li>1 pinch of pepper</li>
</ul>
</div>
</div>

<div id="outline-container-org8afe7e7" class="outline-2">
<h2 id="org8afe7e7">Instructions</h2>
<div class="outline-text-2" id="text-org8afe7e7">
<ol class="org-ol">
<li>Heat 1 tbsp oil in a large frying pan and cook the onion and garlic for 5 minutes, until softened.</li>
<li>Stir in the rice, chilli flakes and paprika, cook for a further minute, then add the stock and tomatoes. Bring to the boil and simmer for 10 minutes, stirring occasionally.</li>
<li>Add the runner beans, pepper and chickpeas and cook for another 10 minutes. Squeeze over the lemon juice and scatter with the parsley.</li>
<li>Serve with lemon</li>
</ol>
</div>
</div>
</div>
</body>
</html>
